{
  "flag": "./Images/ua.png",
  "pdf": "./PDF/CV_Anatoliy_Lehchylin_Front-end_developer,%20english.pdf",
  "pdfText": "Download as .PDF",
  "pdfName": "CV_Anatoliy_Lehchylin_Front-end_developer, english.pdf",
  "name": "Anatoliy LEHCHYLIN",
  "contactsTitle": "Contacts",
  "location": "Ukraine, Poltava",
  "hardSkillTitle": "Hard skill",
  "educationTitle": "Education History",
  "softSkillTitle": "Soft skill",
  "languages": "Languages",
  "danIt": "DAN.IT EDUCATIONS, Kyiv",
  "yearGraduated": "Graduated in 2023",
  "agrarnyi": "Kherson State Agrarian University<br>Industrial and civil construction<br><span style='font-weight: 800'>Civil engineer</span>",
  "softSkill1": "I have experience in personnel\nmanagement, management decisionmaking and control of their\nimplementation\n",
  "softSkill2": "The ability to learn new skills quickly and\napply practically to gain experience",
  "softSkill3": "Welcoming attitude to constructive\ncriticism",
  "uaLangText": "Ukrainian - Native",
  "enLangText": "English - А2 (Pre-Intermediate),\nactively studying",
  "ruLangText": "russian - Native",
  "experienceTitle": "Experience",
  "experienceText": "STATE HYDROGRAPHIC SERVICE OF UKRAINE<br><span style='font-style: italic; font-weight: 700'>Head of the repair and restoration base<br></span>2019 – ongoing<br>Duties: management of the repair and restoration base (30 employees)",
  "summaryTitle": "Summary",
  "summaryText": "&nbsp;&nbsp;&nbsp;I am seeking to be a part of a friendly and professional team where I can develop my skills in creating and maintaining user interfaces with a variety of functionality, while being a valuable member of the team by utilising and expanding my current skill set.<br>&nbsp;&nbsp;&nbsp;I am particularly interested in working with React, JavaScript, and the Material UI framework, as well as in creating non-template web designs.<br>&nbsp;&nbsp;&nbsp;My immediate goals are to learn new development tools and technologies, as well as undertaking practical work with database management systems such as MongoDB. My long term goals are to gain and develop my skills and knowledge and grow my career within the IT industry.",
  "projectTitle": "Project",
  "pharmacyDevelopment": "<span style='font-weight: 700'>Development time:</span> 2 months",
  "pharmacyTechnologies": "<span style='font-weight: 700'>Technologies used:</span> React, Redux-toolkit, React-router, React Testing Library,\nJEST, Axios, Formik, Yup, HTML, SCSS, JavaScript, Vite, MUI, Postman, MongoDB,\nNodeJS, Express, Cloudinary, Git, Responsive web Design",
  "pharmacyDescription": "<span style='font-weight: 700'>Description:</span> an online pharmacy with the possibility of registration and the\navailability of a personal office. The main possibilities have been implemented:\nproduct filtering by categories, price, form, manufacturer, etc.; product and\npharmacy reviews; purchase of goods with receipt of a confirmation letter by\nmail; chat with a pharmacist; adding products to Favorites and Cart;\nreviewed and promotional items",
  "pharmacyRole": "<span style='font-weight: 700'>Role in the project:</span> creation of a page displaying products by category\n(ProductsPage component), the logic of displaying goods by category,\nformation of a product request line, product filtering by parameters, logic\ntransfer of filtering to the address term (searchParams), pagination",
  "shopDevelopment": "<span style='font-weight: 700'>Development time:</span> 1 months",
  "shopTechnologies": "<span style='font-weight: 700'>Technologies used:</span> React, Hooks, Redux, Redux-thunk, React-router, React\nTesting Library, JEST, Fetch, Formik, Yup, HTML, SCSS, JavaScript, Responsive\nweb Design",
  "shopDescription": "<span style='font-weight: 700'>Description:</span> a webpage of an online store with the option to add and\nremove items to Favorites and Cart (separate pages).\nThe following has been implemented in the project: the option to purchase\ngoods by filling out a form; and the option to view listed items displayed as\ncards or table",
  "independentRole": "<span style='font-weight: 700'>Role in the project:</span> : independent project development",
  "cardsDevelopment": "<span style='font-weight: 700'>Development time:</span> 3 weeks",
  "cardsTechnologies": "<span style='font-weight: 700'>Technologies used:</span> HTML, SCSS, JavaScript, Fetch, Gulp, Responsive web\nDesign, REST API\n",
  "cardsDescription": "<span style='font-weight: 700'>Description:</span> a webpage where a receptionist can create cards containing\ninformation regarding scheduled specialist appointments. The following\nhas been implemented in the project: the option to create, edit and delete\nvisit cards stored on the server, and to filter visits by urgency, particular\nspecialist, or purpose of the visit",
  "forkioDevelopment": "<span style='font-weight: 700'>Development time:</span> 2 weeks",
  "forkioTechnologies": "<span style='font-weight: 700'>Technologies used:</span> HTML, SCSS, JavaScript, Gulp, Responsive web Design",
  "forkioDescription": "<span style='font-weight: 700'>Description:</span> the site was created taking into account the principles of\nadaptive layout. The project build is configured using Gulp",
  "humDevelopment": "<span style='font-weight: 700'>Development time:</span> 2 weeks",
  "humTechnologies": "<span style='font-weight: 700'>Technologies used:</span> HTML, CSS, JavaScript",
  "humDescription": "<span style='font-weight: 700'>Description:</span> the site is designed only for wide-format monitors with a\nscreen width of 1200 pixels or more"
}