{
  "flag": "./Images/ua.png",
  "pdf": "./PDF/CV_Anatoliy_Lehchylin_Front-end_developer,%20english.pdf",
  "pdfText": "Download as .PDF",
  "pdfName": "CV_Anatoliy_Lehchylin_Front-end_developer, english.pdf",
  "name": "Anatoliy LEHCHYLIN",
  "contactsTitle": "Contacts",
  "location": "Ukraine, Poltava",
  "hardSkillTitle": "Hard skill",
  "educationTitle": "Education History",
  "softSkillTitle": "Soft skill",
  "languages": "Languages",
  "danIt": "DAN.IT EDUCATIONS, Kyiv",
  "yearGraduated": "Graduated in 2023",
  "agrarnyi": "Kherson State Agrarian University<br>Industrial and civil construction<br><span style='font-weight: 800'>Civil engineer</span>",
  "softSkill1": "I have experience in personnel\nmanagement, management decisionmaking and control of their\nimplementation\n",
  "softSkill2": "The ability to learn new skills quickly and\napply practically to gain experience",
  "softSkill3": "Welcoming attitude to constructive\ncriticism",
  "uaLangText": "Ukrainian - Native",
  "enLangText": "English - B1 (Intermediate),\nactively studying",
  "ruLangText": "russian - Native",
  "experienceTitle": "Experience",
  "experienceText": "STATE HYDROGRAPHIC SERVICE OF UKRAINE<br><span style='font-style: italic; font-weight: 700'>Head of the repair and restoration base<br></span>2019 – ongoing<br>Duties: management of the repair and restoration base (30 employees)",
  "summaryTitle": "Summary",
  "summaryText": "I am seeking to be a part of a friendly and professional team where I can\ndevelop my skills in creating and maintaining user interfaces with a variety of\nfunctionality, while being a valuable member of the team by utilising and\nexpanding my current skill set.\n<br>I am particularly interested in working with React, JavaScript, and Material UI.\nI continue to do server development using Node.js, Express.js, Socket.IO MongoDB.\n<br>My immediate goals are to learn new development tools and technologies,\nas well as undertaking practical work with database management systems",
  "projectTitle": "Project",
  "chatDevelopment": "<span style='font-weight: 700'>Development time:</span> 2 weeks",
  "chatTechnologies": "<span style='font-weight: 700'>Technologies used:</span> React, Redux-toolkit, HTML, CSS, JavaScript, Vite, MUI, Postman, MongoDB,\nNodeJS, Express, Socket.IO, Git, Responsive web Design",
  "chatDescription": "<span style='font-weight: 700'>Description:</span> Chat with the ability to add, edit and delete messages and photos. Realized registration, changing the avatar and password, deleting the user and all his messages.",
  "pharmacyDevelopment": "<span style='font-weight: 700'>Development time:</span> 2 months",
  "pharmacyTechnologies": "<span style='font-weight: 700'>Technologies used:</span> React, Redux-toolkit, React-router, React Testing Library,\nJEST, Axios, Formik, Yup, HTML, SCSS, JavaScript, Vite, MUI, Postman, MongoDB,\nNodeJS, Express, Cloudinary, Git, Responsive web Design",
  "pharmacyDescription": "<span style='font-weight: 700'>Description:</span> an online pharmacy with registration and the availability of a personal\noffice. Functional: product filtering by categories, price, form, etc.; product reviews;\npurchase of goods with receipt of a confirmation letter by mail; chat with a\npharmacist; adding products to Favorites and Cart; reviewed and promotional items",
  "pharmacyRole": "<span style='font-weight: 700'>Role in the project:</span> creation of a page and logic of displaying products by category,\nformation of a product request line, product filtering by parameters, saving the\nfiltering parameters in the URL (searchParams), pagination",
  "carmapDevelopment": "<span style='font-weight: 700'>Development time:</span> 2 days",
  "carmapTechnologies": "<span style='font-weight: 700'>Technologies used:</span> React, JavaScript, CSS, Postman, MongoDB, Node.js, Express.js",
  "carmapDescription": "<span style='font-weight: 700'>Description:</span> test task. A map with announcements is integrated into the project. The\nability to add, edit, delete ads has been implemented; information is stored in MongoDB,\nthanks to the self-written server part of the project",
  "hierarchyDevelopment": "<span style='font-weight: 700'>Development time:</span> 2 days",
  "hierarchyTechnologies": "<span style='font-weight: 700'>Technologies used:</span> React, React-router, Hooks, JavaScript, CSS, Vite",
  "hierarchyDescription": "<span style='font-weight: 700'>Description:</span> test task. An application with the following hierarchical structure of pages\n(tables): Accounts => Profiles => Campaigns. Three clickable tables, which, when you click\non one of the rows, move according to the structure to the selected entity. Sorting, filtering\nand pagination have been implemented for each of the tables",
  "commentsDevelopment": "<span style='font-weight: 700'>Development time:</span> 2 days",
  "commentsTechnologies": "<span style='font-weight: 700'>Technologies used:</span> React, Hooks, JavaScript, CSS, Vite",
  "commentsDescription": "<span style='font-weight: 700'>Description:</span> test task. Implemented the ability to add and delete posts. You can add\ncomments to each post and choose a color identification for the comment. The number of comments made is displayed next to each post",
  "shopDevelopment": "<span style='font-weight: 700'>Development time:</span> 2 weeks",
  "shopTechnologies": "<span style='font-weight: 700'>Technologies used:</span> React, Hooks, Redux, Redux-thunk, React-router, React\nTesting Library, JEST, Fetch, Formik, Yup, HTML, SCSS, JavaScript, Responsive\nweb Design",
  "shopDescription": "<span style='font-weight: 700'>Description:</span> web page of the online store with the ability to add and remove products\nto Favorites and Cart (separate pages). The opportunity to purchase goods by filling\nout the form. Switching display of products in the form of cards or of a table",
  "independentRole": "<span style='font-weight: 700'>Role in the project:</span> independent project development",
  "cardsDevelopment": "<span style='font-weight: 700'>Development time:</span> 2 weeks",
  "cardsTechnologies": "<span style='font-weight: 700'>Technologies used:</span> HTML, SCSS, JS, Fetch, Gulp, Responsive web\nDesign, REST API\n",
  "cardsDescription": "<span style='font-weight: 700'>Description:</span> page where create, edit, and delete cards that describe scheduled\ndoctor visits. Cards are stored on the server, visits are filtered by urgency, choice of\ndoctor or purpose of the visit",
  "forkioDevelopment": "<span style='font-weight: 700'>Development time:</span> 2 weeks",
  "forkioTechnologies": "<span style='font-weight: 700'>Technologies used:</span> HTML, SCSS, JavaScript, Gulp, Responsive web Design",
  "forkioDescription": "<span style='font-weight: 700'>Description:</span> the site was created taking into account the principles of\nadaptive layout. The project build is configured using Gulp",
  "humDevelopment": "<span style='font-weight: 700'>Development time:</span> 2 weeks",
  "humTechnologies": "<span style='font-weight: 700'>Technologies used:</span> HTML, CSS, JavaScript",
  "humDescription": "<span style='font-weight: 700'>Description:</span> the site is designed only for wide-format monitors with a\nscreen width of 1200 pixels or more"
}